interface Result {
    name: string,
    skill: string,
    tags: Array<string>,
    traits: { [key: string]: number },
    context: string,
    good: [number, number],
    bad: [number, number],
}

const resultDict: {
    [key: number]: Result
} = {
    0b0010: {
        "name": "超人車車",
        "skill": "廣獲民心",
        "tags": [
            "#全村的希望",
            "#我來我來",
            "#我罩你"
        ],
        "traits": {
            "逞強": 2,
            "領導": 5,
            "自信": 3,
            "責任心": 4,
            "熱忱": 4
        },
        "context": "你擁有強大的力量，只要在你的引領下，任何問題都無法阻礙你和夥伴前進。你總是充滿著活力和決心，並在需要時挺身而出，成為大家最強大的後盾。但有時要注意別太逞強以及懂得休息，否則會讓自己受傷。",
        "good": [
            0b0000,
            0b0101
        ],
        "bad": [
            0b1010,
            0b1011
        ]
    },
    0b0011: {
        "name": "超速車車",
        "skill": "踏板一踩輕鬆超過120km/h",
        "tags": [
            "#衝一波",
            "#此時不衝更待何時",
            "#衝衝衝衝引擎發動"
        ],
        "traits": {
            "選擇障礙": 0,
            "拐彎抹角": 0,
            "引擎催落": 5,
            "目標": 3,
            "野心": 4
        },
        "context": "直來直往的你有時會不小心過於衝動，不過毫不猶豫的態度也讓人佩服，甚至給人一種瀟灑的感覺。如果想要改變，在做事前可以先思考並慢慢來，有助於你看清楚整體局面，做出更理智的決定。",
        "good": [
            0b0100,
            0b0111
        ],
        "bad": [
            0b1101,
            0b1111
        ]
    },
    0b0000: {
        "name": "救護車車",
        "skill": "有事隨call隨到 沒call也到",
        "tags": [
            "#超暖",
            "#暖你一整天",
            "#有事call我"
        ],
        "traits": {
            "可靠": 4,
            "體貼": 5,
            "敏銳": 4,
            "犧牲小我": 2,
            "同理心": 3
        },
        "context": "你是一位帶有溫暖氛圍的人，時常注意到他人需要幫忙的地方並主動伸出援手，讓人感到安心和被關愛，是大家公認的暖男/女。不過在關心他人的同時，記得也要留一份溫暖給自己喔，別忘了自己也是需要被呵護的。",
        "good": [
            0b0010,
            0b1111
        ],
        "bad": [
            0b1110,
            0b1010
        ]
    },
    0b1100: {
        "name": "拉風車車",
        "skill": "潮流小達人",
        "tags": [
            "#cool",
            "boy/girl",
            "#ootd #潮到出水"
        ],
        "traits": {
            "潮": 5,
            "美感": 4,
            "魅力": 5,
            "拍照": 3,
            "社群經營": 2
        },
        "context": "你擁有獨特的個人風格，喜歡關注時下流行的東西，任何網路潮流你都知道，也能在這其中營造出特別的個人形象。你能在日常生活中融入一些獨特的元素，讓平凡的時刻變得獨具魅力，這種敏銳感受力和對於生活的熱愛，使你成為一個充滿魅力的人。",
        "good": [
            0b0001,
            0b1000
        ],
        "bad": [
            0b1001,
            0b0110
        ]
    },
    0b1110: {
        "name": "故事車車",
        "skill": "說不完的故事",
        "tags": [
            "#我跟你說",
            "#我有故事你有酒嗎",
            "#想當年"
        ],
        "traits": {
            "說故事": 3,
            "青澀": 0,
            "人情世故": 4,
            "沉穩": 3,
            "歷練": 5
        },
        "context": "你是個經歷過各種風霜的人，過去的歷練造就了現在的你，也因為這樣讓你變得比他人更加沉穩，給人一種成熟的感覺。另外，正因為你遇過各種事件，豐富的經驗使得你在面對挑戰時顯得更加從容自信。",
        "good": [
            0b1010,
            0b1001
        ],
        "bad": [
            0b0000,
            0b0001
        ]
    },
    0b0100: {
        "name": "瘋子車車",
        "skill": "越瘋越嗨、越嗨越瘋",
        "tags": [
            "#衝呀！",
            "#我誰！",
            "#人生無極限"
        ],
        "traits": {
            "胡言亂語": 4,
            "夜深人靜emo": 3,
            "執行力": 5,
            "鬼點子": 5,
            "勇敢": 4
        },
        "context": "在大家面前，你是不知疲倦為何物的冒險家，常常冒出驚嚇眾人的想法並實際付諸行動，因此被稱為瘋子。不過沒人知道的是，在某些夜晚你會獨自窩在房間裡，進入深層思考和自己對話（或是emo），是個隱藏的哲學家。",
        "good": [
            0b0011,
            0b0101
        ],
        "bad": [
            0b1011,
            0b1000
        ]
    },
    0b1010: {
        "name": "害羞車車",
        "skill": "隨時隨地找到保護色",
        "tags": [
            "#不要看我",
            "#i'msupershy",
            "#好緊張"
        ],
        "traits": {
            "變色龍": 5,
            "內在魅力": 5,
            "察言觀色": 4,
            "高調": 0,
            "謹慎": 3
        },
        "context": "你不習慣大眾的目光都集中在自己身上，如果能躲就會找地方躲起來，也不喜歡太過於熱鬧的社交場合，你可能會覺得不太自在。但其實只要和你變得熟悉，就能發現你其實是一個充滿魅力的寶藏男/女孩！",
        "good": [
            0b1110,
            0b1011
        ],
        "bad": [
            0b0010,
            0b0000
        ]
    },
    0b0111: {
        "name": "超級機車",
        "skill": "辯論大賽冠軍",
        "tags": [
            "#我不要你覺得我要我覺得",
            "#可愛又迷人的反派角色",
            "#蛤可是"
        ],
        "traits": {
            "辯論": 5,
            "堅持": 4,
            "妥協": 0,
            "自信": 2,
            "讀空氣": 0
        },
        "context": "雖然旁人有時會覺得你意見多、有點龜毛，但其實這都是出自於你對於在意的事情的堅持，而這正是你的魅力所在，儘管別人說三道四也不會在意，秉持著自己的信念勇往直前。不過如果有時候能懂得退讓或是學習接納他人，相信能讓大家覺得更親近一些喔！",
        "good": [
            0b0011,
            0b0001
        ],
        "bad": [
            0b1101,
            0b1000
        ]
    },
    0b0001: {
        "name": "勝利車車",
        "skill": "人生勝利組",
        "tags": [
            "#這有很難嗎",
            "#技能全點滿",
            "#開局五星配備"
        ],
        "traits": {
            "才華": 5,
            "自信": 4,
            "態度": 4,
            "偷懶": 2,
            "自我要求": 5
        },
        "context": "在團體中你總是十分耀眼，大家都很羨慕你，總是覺得你光彩奪目，好像什麼事你都能做好。在這樣的目光與期待之下，有時你會十分有壓力，深怕自己做不好，沒辦法達到大家的期望。適時的放鬆與休息對你來說十分重要，身心健康才能走更長遠的路。",
        "good": [
            0b1100,
            0b0111
        ],
        "bad": [
            0b1110,
            0b0110
        ]
    },
    0b1011: {
        "name": "幽靈車車",
        "skill": "一語中的",
        "tags": [
            "#神出鬼沒",
            "#突破盲腸",
            "#語出驚人"
        ],
        "traits": {
            "存在感": 2,
            "邏輯": 5,
            "小聰明": 4,
            "古靈精怪": 5,
            "社交": 1
        },
        "context": "雖然你沒有那麼喜歡團體生活，但還是有幾個特別好的摯友能跟你談心。就算大家沒有那麼認同你，你還是喜歡你的生活方式，這樣的模式讓你感到舒服自在。你總是能用旁觀者的視角看事情，十分理性，也懂得處理問題，找出盲點並點醒眾人，是團體中的智者。",
        "good": [
            0b1010,
            0b1001
        ],
        "bad": [
            0b0010,
            0b0100
        ]
    },
    0b1101: {
        "name": "氣質車車",
        "skill": "溫柔的生氣",
        "tags": [
            "#氣質擔當",
            "#輕聲細語",
            "#飽讀詩書"
        ],
        "traits": {
            "突破": 1,
            "文靜": 4,
            "溫柔": 5,
            "距離感": 3,
            "細膩": 4
        },
        "context": "充滿氣質的你讓許多人都很欣賞你，有時也會覺得你很有距離感，但身邊的好朋友都知道其實你很好相處。你喜歡待在自己的舒適圈，做自己熟悉的事務。有時不妨嘗試新的活動，不僅可以豐富你的視野，也可以探索新的興趣和生活模式。",
        "good": [
            0b1000,
            0b0110
        ],
        "bad": [
            0b0011,
            0b0111
        ]
    },
    0b1111: {
        "name": "娃娃車車",
        "skill": "走到哪都最可愛",
        "tags": [
            "#鵝子女鵝",
            "#忙內",
            "#小寶"
        ],
        "traits": {
            "惹人愛": 5,
            "認路": 1,
            "貼心": 4,
            "善良": 5,
            "冒失": 3
        },
        "context": "天真善良的你，讓身邊的人都很喜歡跟你相處，有好事或好東西就會想到你，想跟你分享。但因為個性大喇喇的，有時候會不小心犯下可愛又惱人的小失誤，日後可以再多注意一些喔！",
        "good": [
            0b0000,
            0b0110
        ],
        "bad": [
            0b0011,
            0b0101
        ]
    },
    0b0101: {
        "name": "越野車車",
        "skill": "極限挑戰",
        "tags": [
            "#陽光boy/girl",
            "#走了啦",
            "#八月正午的陽光都沒你耀眼"
        ],
        "traits": {
            "行動力": 5,
            "勇氣": 4,
            "坦率": 5,
            "拖延症": 1,
            "脾氣": 4
        },
        "context": "你總是能充滿活力的面對生活大小事，行動力高，身邊的人也會因為你的能量而獲得正面的影響。但有時你會太義氣用事，或許可以多聽取別人的建議，策劃後再行動除了能減少犯錯的機率也可以減少對你的傷害。",
        "good": [
            0b0010,
            0b0100
        ],
        "bad": [
            0b1111,
            0b1001
        ]
    },
    0b1001: {
        "name": "老人車車",
        "skill": "見怪不怪",
        "tags": [
            "#累了",
            "#日出而作日落而息",
            "#大智若愚"
        ],
        "traits": {
            "沈穩": 5,
            "活力": 2,
            "淡定": 4,
            "智慧": 4,
            "體貼": 5
        },
        "context": "沈穩內斂的你讓身邊的人很有安全感也十分信任你。你十分懂得察言觀色，淡定的個性也讓你能比別人更快看清事情的盲點，能適時的給予他人關懷與幫助。雖然如此，不善表達的你讓身邊的人都不太知道你內心的想法，或許有時候可以多分享一些自己的事，讓身邊的人也能關心你喔。",
        "good": [
            0b1110,
            0b1011
        ],
        "bad": [
            0b1100,
            0b0101
        ]
    },
    0b1000: {
        "name": "文青車車",
        "skill": "店面質感照隨手拍",
        "tags": [
            "#跑咖",
            "#底片送去洗了",
            "#無印良品 #大地色"
        ],
        "traits": {
            "氣質": 4,
            "閱讀量": 3.5,
            "儀式感": 5,
            "謹慎": 4,
            "優柔寡斷": 4
        },
        "context": "你對生活很有品味，喜歡沈浸在自己的世界中，也喜歡與同好的人相處。有想法有個性的你有時無法融入一些較少接觸的人事物，這時或許可以試著放下偏見，嘗試看看新的事物，突破自己。",
        "good": [
            0b1100,
            0b1101
        ],
        "bad": [
            0b0100,
            0b0111
        ]
    },
    0b0110: {
        "name": "吃貨車車",
        "skill": "很多個胃",
        "tags": [
            "#餓了",
            "#明天再減肥",
            "#這間我吃過"
        ],
        "traits": {
            "IG美食收藏": 5,
            "正能量": 4,
            "零食": 5,
            "減肥": 0,
            "親切": 4.5
        },
        "context": "你是一個充滿正能量的人，身邊的人都很喜歡跟你相處。你總是不吝嗇於願意分享好事、好東西給大家，在你身邊總是快樂滿滿！不過你有時候做事會缺乏毅力，所以沒辦法那麽順利的完成事情，或許可以試著改變讓自己變得更好！",
        "good": [
            0b1101,
            0b1111
        ],
        "bad": [
            0b1100,
            0b0001
        ]
    }
};

const resultArray = Object.entries(resultDict).sort(([v1,], [v2,]) => parseInt(v1) - parseInt(v2)).map(([v, d]) => d);

export default resultArray;
